AlmAck/svdtonuttx/demo/h/da1470_i2c2.h
#define ACK_GEN_CALL                              (1U << 0) /* ACK General Call. When set to 1, I2C Ctrl responds with a ACK (by asserting ic_d */

/* I2C2_CLR_ACTIVITY Register */

#define CLR_ACTIVITY                              (1U << 0) /* Reading this register clears the ACTIVITY interrupt if the I2C is not active any */

/* I2C2_CLR_GEN_CALL Register */

#define CLR_GEN_CALL                              (1U << 0) /* Read this register to clear the GEN_CALL interrupt (bit 11) of I2C_RAW_INTR_STAT */

/* I2C2_CLR_INTR Register */

#define CLR_INTR                                  (1U << 0) /* Read this register to clear the combined interrupt, all individual interrupts, a */

/* I2C2_CLR_RD_REQ Register */

#define CLR_RD_REQ                                (1U << 0) /* Read this register to clear the RD_REQ interrupt (bit 5) of the I2C_RAW_INTR_STA */

/* I2C2_CLR_RX_DONE Register */

#define CLR_RX_DONE                               (1U << 0) /* Read this register to clear the RX_DONE interrupt (bit 7) of the I2C_RAW_INTR_ST */

/* I2C2_CLR_RX_OVER Register */

#define CLR_RX_OVER                               (1U << 0) /* Read this register to clear the RX_OVER interrupt (bit 1) of the I2C_RAW_INTR_ST */

/* I2C2_CLR_RX_UNDER Register */

#define CLR_RX_UNDER                              (1U << 0) /* Read this register to clear the RX_UNDER interrupt (bit 0) of the I2C_RAW_INTR_S */

/* I2C2_CLR_START_DET Register */

#define CLR_START_DET                             (1U << 0) /* Read this register to clear the START_DET interrupt (bit 10) of the IC_RAW_INTR_ */

/* I2C2_CLR_STOP_DET Register */

#define CLR_STOP_DET                              (1U << 0) /* Read this register to clear the STOP_DET interrupt (bit 9) of the IC_RAW_INTR_ST */

/* I2C2_CLR_TX_ABRT Register */

#define CLR_TX_ABRT                               (1U << 0) /* Read this register to clear the TX_ABRT interrupt (bit 6) of the IC_RAW_INTR_STA */

/* I2C2_CLR_TX_OVER Register */

#define CLR_TX_OVER                               (1U << 0) /* Read this register to clear the TX_OVER interrupt (bit 3) of the I2C_RAW_INTR_ST */

/* I2C2_CON Register */

#define I2C_STOP_DET_IF_MASTER_ACTIVE             (1U << 10) /* In Master mode: 1 = issues the STOP_DET interrupt only when master is active. 0  */
#define I2C_RX_FIFO_FULL_HLD_CTRL                 (1U << 9) /* This bit controls whether DW_apb_i2c should hold the bus when the Rx FIFO is phy */
#define I2C_TX_EMPTY_CTRL                         (1U << 8) /* This bit controls the generation of the TX_EMPTY interrupt, as described in the  */
#define I2C_STOP_DET_IFADDRESSED                  (1U << 7) /* 1 = slave issues STOP_DET intr only if addressed 0 = slave issues STOP_DET intr  */
#define I2C_SLAVE_DISABLE                         (1U << 6) /* Slave enabled or disabled after reset is applied, which means software does not  */
#define I2C_RESTART_EN                            (1U << 5) /* Determines whether RESTART conditions may be sent when acting as a master 0= dis */
#define I2C_10BITADDR_MASTER                      (1U << 4) /* Controls whether the controller starts its transfers in 7- or 10-bit addressing  */
#define I2C_10BITADDR_SLAVE                       (1U << 3) /* When acting as a slave, this bit controls whether the controller responds to 7-  */
#define I2C_SPEED_MASK                            (0x3 << 1) /* These bits control at which speed the controller operates. 1= standard mode (100 */
#define I2C_SPEED_POS                             (1) /* These bits control at which speed the controller operates. 1= standard mode (100 */
#define I2C_MASTER_MODE                           (1U << 0) /* This bit controls whether the controller master is enabled. 0= master disabled 1 */

/* I2C2_DATA_CMD Register */

#define I2C_RESTART                               (1U << 10) /* This bit controls whether a RESTART is issued before the byte is sent or receive */
#define I2C_STOP                                  (1U << 9) /* This bit controls whether a STOP is issued after the byte is sent or received. 1 */
#define I2C_CMD                                   (1U << 8) /* This bit controls whether a read or a write is performed. This bit does not cont */
#define I2C_DAT_MASK                              (0xFF << 0) /* This register contains the data to be transmitted or received on the I2C bus. If */
#define I2C_DAT_POS                               (0) /* This register contains the data to be transmitted or received on the I2C bus. If */

/* I2C2_DMA_CR Register */

#define TDMAE                                     (1U << 1) /* Transmit DMA Enable. //This bit enables/disables the transmit FIFO DMA channel.  */
#define RDMAE                                     (1U << 0) /* Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel. 0 =  */

/* I2C2_DMA_RDLR Register */

#define DMARDL_MASK                               (0x1F << 0) /* Receive Data Level. This bit field controls the level at which a DMA request is  */
#define DMARDL_POS                                (0) /* Receive Data Level. This bit field controls the level at which a DMA request is  */

/* I2C2_DMA_TDLR Register */

#define DMATDL_MASK                               (0x1F << 0) /* Transmit Data Level. This bit field controls the level at which a DMA request is */
#define DMATDL_POS                                (0) /* Transmit Data Level. This bit field controls the level at which a DMA request is */

/* I2C2_ENABLE Register */

#define I2C_TX_CMD_BLOCK                          (1U << 2) /* In Master mode: 1 = Blocks the transmission of data on I2C bus even if Tx FIFO h */
#define I2C_ABORT                                 (1U << 1) /* The software can abort the I2C transfer in master mode by setting this bit. The  */
#define I2C_EN                                    (1U << 0) /* Controls whether the controller is enabled. 0 = Disables the controller (TX and  */

/* I2C2_ENABLE_STATUS Register */

#define SLV_RX_DATA_LOST                          (1U << 2) /* Slave Received Data Lost. This bit indicates if a Slave-Receiver operation has b */
#define SLV_DISABLED_WHILE_BUSY                   (1U << 1) /* Slave Disabled While Busy (Transmit, Receive). This bit indicates if a potential */
#define IC_EN                                     (1U << 0) /* ic_en Status. This bit always reflects the value driven on the output port ic_en */

/* I2C2_FS_SCL_HCNT Register */

