AlmAck/svdtonuttx/demo/h/da1470_i2c2.h
#define IC_FS_SCL_HCNT_MASK                       (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define IC_FS_SCL_HCNT_POS                        (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_FS_SCL_LCNT Register */

#define IC_FS_SCL_LCNT_MASK                       (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define IC_FS_SCL_LCNT_POS                        (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_HS_MADDR Register */

#define I2C_IC_HS_MAR_MASK                        (0x7 << 0) /* This bit field holds the value of the I2C HS mode master code. HS-mode master co */
#define I2C_IC_HS_MAR_POS                         (0) /* This bit field holds the value of the I2C HS mode master code. HS-mode master co */

/* I2C2_HS_SCL_HCNT Register */

#define IC_HS_SCL_HCNT_MASK                       (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define IC_HS_SCL_HCNT_POS                        (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_HS_SCL_LCNT Register */

#define IC_HS_SCL_LCNT_MASK                       (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define IC_HS_SCL_LCNT_POS                        (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_IC_FS_SPKLEN Register */

#define I2C_FS_SPKLEN_MASK                        (0xFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_FS_SPKLEN_POS                         (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_IC_HS_SPKLEN Register */

#define I2C_HS_SPKLEN_MASK                        (0xFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_HS_SPKLEN_POS                         (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_INTR_MASK Register */

#define M_SCL_STUCK_AT_LOW                        (1U << 14) /* M_SCL_STUCK_AT_LOW Register field Reserved bits */
#define M_MASTER_ON_HOLD                          (1U << 13) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_RESTART_DET                             (1U << 12) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_GEN_CALL                                (1U << 11) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_START_DET                               (1U << 10) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_STOP_DET                                (1U << 9) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_ACTIVITY                                (1U << 8) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_RX_DONE                                 (1U << 7) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_TX_ABRT                                 (1U << 6) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_RD_REQ                                  (1U << 5) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_TX_EMPTY                                (1U << 4) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_TX_OVER                                 (1U << 3) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_RX_FULL                                 (1U << 2) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_RX_OVER                                 (1U << 1) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define M_RX_UNDER                                (1U << 0) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */

/* I2C2_INTR_STAT Register */

#define R_SCL_STUCK_AT_LOW                        (1U << 14) /* 1 = R_SCL_STUCK_AT_LOW interrupt is active 0 = R_SCL_STUCK_AT_LOW interrupt is i */
#define R_MASTER_ON_HOLD                          (1U << 13) /* Indicates whether master is holding the bus and TX FIFO is empty. Enabled only w */
#define R_RESTART_DET                             (1U << 12) /* Indicates whether a RESTART condition has occurred on the I2C interface when DW_ */
#define R_GEN_CALL                                (1U << 11) /* Set only when a General Call address is received and it is acknowledged. It stay */
#define R_START_DET                               (1U << 10) /* Indicates whether a START or RESTART condition has occurred on the I2C interface */
#define R_STOP_DET                                (1U << 9) /* Indicates whether a STOP condition has occurred on the I2C interface regardless  */
#define R_ACTIVITY                                (1U << 8) /* This bit captures I2C Ctrl activity and stays set until it is cleared. There are */
#define R_RX_DONE                                 (1U << 7) /* When the controller is acting as a slave-transmitter, this bit is set to 1 if th */
#define R_TX_ABRT                                 (1U << 6) /* This bit indicates if the controller, as an I2C transmitter, is unable to comple */
#define R_RD_REQ                                  (1U << 5) /* This bit is set to 1 when the controller is acting as a slave and another I2C ma */
#define R_TX_EMPTY                                (1U << 4) /* This bit is set to 1 when the transmit buffer is at or below the threshold value */
#define R_TX_OVER                                 (1U << 3) /* Set during transmit if the transmit buffer is filled to 32 and the processor att */
#define R_RX_FULL                                 (1U << 2) /* Set when the receive buffer reaches or goes above the RX_TL threshold in the I2C */
#define R_RX_OVER                                 (1U << 1) /* Set if the receive buffer is completely filled to 32 and an additional byte is r */
#define R_RX_UNDER                                (1U << 0) /* Set if the processor attempts to read the receive buffer when it is empty by rea */

/* I2C2_RAW_INTR_STAT Register */

#define SCL_STUCK_AT_LOW                          (1U << 14) /* CL_STUCK_AT_LOW Register field Reserved bits */
#define MASTER_ON_HOLD                            (1U << 13) /* ndicates whether master is holding the bus and TX FIFO is empty. Enabled only wh */
#define RESTART_DET                               (1U << 12) /* Indicates whether a RESTART condition has occurred on the I2C interface when DW_ */
#define GEN_CALL                                  (1U << 11) /* Set only when a General Call address is received and it is acknowledged. It stay */
#define START_DET                                 (1U << 10) /* Indicates whether a START or RESTART condition has occurred on the I2C interface */
#define STOP_DET                                  (1U << 9) /* Indicates whether a STOP condition has occurred on the I2C interface regardless  */
#define ACTIVITY                                  (1U << 8) /* This bit captures I2C Ctrl activity and stays set until it is cleared. There are */
#define RX_DONE                                   (1U << 7) /* When the controller is acting as a slave-transmitter, this bit is set to 1 if th */
#define TX_ABRT                                   (1U << 6) /* This bit indicates if the controller, as an I2C transmitter, is unable to comple */
#define RD_REQ                                    (1U << 5) /* This bit is set to 1 when I2C Ctrl is acting as a slave and another I2C master i */
#define TX_EMPTY                                  (1U << 4) /* This bit is set to 1 when the transmit buffer is at or below the threshold value */
#define TX_OVER                                   (1U << 3) /* Set during transmit if the transmit buffer is filled to 32 and the processor att */
#define RX_FULL                                   (1U << 2) /* Set when the receive buffer reaches or goes above the RX_TL threshold in the I2C */
#define RX_OVER                                   (1U << 1) /* Set if the receive buffer is completely filled to 32 and an additional byte is r */
#define RX_UNDER                                  (1U << 0) /* Set if the processor attempts to read the receive buffer when it is empty by rea */

