AlmAck/svdtonuttx/demo/h/da1470_i2c2.h
/* I2C2_RXFLR Register */

#define RXFLR_MASK                                (0x3F << 0) /* Receive FIFO Level. Contains the number of valid data entries in the receive FIF */
#define RXFLR_POS                                 (0) /* Receive FIFO Level. Contains the number of valid data entries in the receive FIF */

/* I2C2_RX_TL Register */

#define RX_TL_MASK                                (0x1F << 0) /* Receive FIFO Threshold Level Controls the level of entries (or above) that trigg */
#define RX_TL_POS                                 (0) /* Receive FIFO Threshold Level Controls the level of entries (or above) that trigg */

/* I2C2_SAR Register */

#define IC_SAR_MASK                               (0x3FF << 0) /* The IC_SAR holds the slave address when the I2C is operating as a slave. For 7-b */
#define IC_SAR_POS                                (0) /* The IC_SAR holds the slave address when the I2C is operating as a slave. For 7-b */

/* I2C2_SDA_HOLD Register */

#define I2C_SDA_RX_HOLD_MASK                      (0xFF << 16) /* Sets the required SDA hold time in units of ic_clk period, when receiver. */
#define I2C_SDA_RX_HOLD_POS                       (16) /* Sets the required SDA hold time in units of ic_clk period, when receiver. */
#define I2C_SDA_TX_HOLD_MASK                      (0xFFFF << 0) /* Sets the required SDA hold time in units of ic_clk period, when transmitter. */
#define I2C_SDA_TX_HOLD_POS                       (0) /* Sets the required SDA hold time in units of ic_clk period, when transmitter. */

/* I2C2_SDA_SETUP Register */

#define SDA_SETUP_MASK                            (0xFF << 0) /* SDA Setup. This register controls the amount of time delay (number of I2C clock  */
#define SDA_SETUP_POS                             (0) /* SDA Setup. This register controls the amount of time delay (number of I2C clock  */

/* I2C2_SS_SCL_HCNT Register */

#define IC_SS_SCL_HCNT_MASK                       (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define IC_SS_SCL_HCNT_POS                        (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_SS_SCL_LCNT Register */

#define IC_SS_SCL_LCNT_MASK                       (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define IC_SS_SCL_LCNT_POS                        (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C2_STATUS Register */

#define LV_HOLD_RX_FIFO_FULL                      (1U << 10) /* This bit indicates the BUS Hold in Slave mode due to Rx FIFO is Full and an addi */
#define SLV_HOLD_TX_FIFO_EMPTY                    (1U << 9) /* This bit indicates the BUS Hold in Slave mode for the Read request when the Tx F */
#define MST_HOLD_RX_FIFO_FULL                     (1U << 8) /* This bit indicates the BUS Hold in Master mode due to Rx FIFO is Full and additi */
#define MST_HOLD_TX_FIFO_EMPTY                    (1U << 7) /* the DW_apb_i2c master stalls the write transfer when Tx FIFO is empty, and the t */
#define SLV_ACTIVITY                              (1U << 6) /* Slave FSM Activity Status. When the Slave Finite State Machine (FSM) is not in t */
#define MST_ACTIVITY                              (1U << 5) /* Master FSM Activity Status. When the Master Finite State Machine (FSM) is not in */
#define RFF                                       (1U << 4) /* Receive FIFO Completely Full. When the receive FIFO is completely full, this bit */
#define RFNE                                      (1U << 3) /* Receive FIFO Not Empty. This bit is set when the receive FIFO contains one or mo */
#define TFE                                       (1U << 2) /* Transmit FIFO Completely Empty. When the transmit FIFO is completely empty, this */
#define TFNF                                      (1U << 1) /* Transmit FIFO Not Full. Set when the transmit FIFO contains one or more empty lo */
#define I2C_ACTIVITY                              (1U << 0) /* I2C Activity Status. */

/* I2C2_TAR Register */

#define SPECIAL                                   (1U << 11) /* On read This bit indicates whether software performs a General Call or START BYT */
#define GC_OR_START                               (1U << 10) /* On read If bit 11 (SPECIAL) is set to 1, then this bit indicates whether a Gener */
#define IC_TAR_MASK                               (0x3FF << 0) /* This is the target address for any master transaction. When transmitting a Gener */
#define IC_TAR_POS                                (0) /* This is the target address for any master transaction. When transmitting a Gener */

/* I2C2_TXFLR Register */

#define TXFLR_MASK                                (0x3F << 0) /* Transmit FIFO Level. Contains the number of valid data entries in the transmit F */
#define TXFLR_POS                                 (0) /* Transmit FIFO Level. Contains the number of valid data entries in the transmit F */

/* I2C2_TX_ABRT_SOURCE Register */

#define ABRT_USER_ABRT                            (1U << 16) /* Master-Transmitter : This is a master-mode-only bit. Master has detected the tra */
#define ABRT_SLVRD_INTX                           (1U << 15) /* Slave-Transmitter : When the processor side responds to a slave mode request for */
#define ABRT_SLV_ARBLOST                          (1U << 14) /* Slave-Transmitter : Slave lost the bus while transmitting data to a remote maste */
#define ABRT_SLVFLUSH_TXFIFO                      (1U << 13) /* Slave-Transmitter : Slave has received a read command and some data exists in th */
#define ARB_LOST                                  (1U << 12) /* Master-Transmitter or Slave-Transmitter : Master has lost arbitration, or if I2C */
#define ABRT_MASTER_DIS                           (1U << 11) /* Master-Transmitter or Master-Receiver : User tries to initiate a Master operatio */
#define ABRT_10B_RD_NORSTRT                       (1U << 10) /* Master-Receiver : The restart is disabled (IC_RESTART_EN bit (I2C_CON[5]) = 0) a */
#define ABRT_SBYTE_NORSTRT                        (1U << 9) /* Master : To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed firs */
#define ABRT_HS_NORSTRT                           (1U << 8) /* Master-Transmitter or Master-Receiver : The restart is disabled (IC_RESTART_EN b */
#define ABRT_SBYTE_ACKDET                         (1U << 7) /* Master : Master has sent a START Byte and the START Byte was acknowledged (wrong */
#define ABRT_HS_ACKDET                            (1U << 6) /* Master : Master is in High Speed mode and the High Speed Master code was acknowl */
#define ABRT_GCALL_READ                           (1U << 5) /* Master-Transmitter : The controller in master mode sent a General Call but the u */
#define ABRT_GCALL_NOACK                          (1U << 4) /* Master-Transmitter : the controller in master mode sent a General Call and no sl */
#define ABRT_TXDATA_NOACK                         (1U << 3) /* Master-Transmitter : This is a master-mode only bit. Master has received an ackn */
#define ABRT_10ADDR2_NOACK                        (1U << 2) /* Master-Transmitter or Master-Receiver : Master is in 10-bit address mode and the */
#define ABRT_10ADDR1_NOACK                        (1U << 1) /* Master-Transmitter or Master-Receiver : Master is in 10-bit address mode and the */
#define ABRT_7B_ADDR_NOACK                        (1U << 0) /* Master-Transmitter or Master-Receiver : Master is in 7-bit addressing mode and t */

/* I2C2_TX_TL Register */

#define TX_TL_MASK                                (0x1F << 0) /* Transmit FIFO Threshold Level Controls the level of entries (or below) that trig */
#define TX_TL_POS                                 (0) /* Transmit FIFO Threshold Level Controls the level of entries (or below) that trig */

#endif /* __DA1470_I2C2_H */
